const handler = async (m, { conn }) => {
  const vi = ['https://telegra.ph/file/523e4cd6e968fcab7c160.mp4']

  let menu = `👋🏻 𝖧𝗈𝗅𝖺! 𝖻𝗂𝖾𝗇𝗏𝖾𝗇𝗂𝖽𝗈 𝖺𝗅 𝗆𝖾𝗇𝗎𝗀𝗋𝗎𝗉𝗈 𝖽𝖾 *𝐗 𝐁𝐎𝐓 𝖨𝖠* 𝖺𝗊𝗎𝗂́ 𝖾𝗇𝖼𝗈𝗇𝗍𝗋𝖺𝗋𝖺𝗌 𝗅𝗈𝗌 𝖼𝗈𝗆𝖺𝗇𝖽𝗈𝗌 𝗉𝖺𝗋𝖺 𝗆𝖺𝗇𝗍𝖾𝗇𝖾𝗋 𝗎𝗇 𝗍𝗈𝗍𝖺𝗅 𝗈𝗋𝖽𝖾𝗇 𝖾𝗇 𝗍𝗎𝗌 𝖼𝗈𝗆𝗉𝖾𝗍𝗂𝗍𝗂𝗏𝗈𝗌!

✮,— \`𝖢𝖮𝖬𝖠𝖭𝖣𝖮𝖲 𝖣𝖤 𝖥𝖱𝖤𝖤 𝖥𝖨𝖱𝖤\` .ᐟᨮׁׅ֮.ᐟ
⭒ ִֶָ७ ꯭🥤˙⋆｡ -4𝘷𝘴4 𝙝𝙤𝙧𝙖 𝙮 𝙥𝙖𝙞𝙨
⭒ ִֶָ७ ꯭🥤˙⋆｡ -6𝘷𝘴6 𝙝𝙤𝙧𝙖 𝙮 𝙥𝙖𝙞𝙨
⭒ ִֶָ७ ꯭🥤˙⋆｡ -8𝘷𝘴8 𝙝𝙤𝙧𝙖 𝙮 𝙥𝙖𝙞𝙨
⭒ ִֶָ७ ꯭🥤˙⋆｡ -12𝘷𝘴12 𝙝𝙤𝙧𝙖 𝙮 𝙥𝙖𝙞𝙨
⭒ ִֶָ७ ꯭🥤˙⋆｡ -16𝘷𝘴16 𝙝𝙤𝙧𝙖 𝙮 𝙥𝙖𝙞𝙨
⭒ ִֶָ७ ꯭🥤˙⋆｡ -20𝘷𝘴20 𝙝𝙤𝙧𝙖 𝙮 𝙥𝙖𝙞𝙨
⭒ ִֶָ७ ꯭🥤˙⋆｡ -24𝘷𝘴24 𝙝𝙤𝙧𝙖 𝙮 𝙥𝙖𝙞𝙨
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘪𝘯𝘵𝘦𝘳𝘯𝘢4𝘷𝘴4 𝙝𝙤𝙳
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘪𝘯𝘵𝘦𝘳𝘯𝘢6𝘷𝘴6 𝙝𝙤𝙳
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘴𝘤𝘳𝘪𝘮
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘴𝘤𝘳𝘪𝘮𝘥𝘶𝘰
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘮𝘢𝘱𝘢𝘤𝘶𝘢𝘥𝘳𝘪𝘭𝘢𝘵𝘦𝘳𝘰
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘭𝘪𝘴𝘵𝘢𝘤𝘶𝘢𝘥𝘳𝘪𝘭𝘢𝘵𝘦𝘳𝘰
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘮𝘢𝘱𝘢𝘩𝘦𝘹𝘢𝘨𝘰𝘯𝘢𝘭
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘭𝘪𝘴𝘵𝘢𝘩𝘦𝘹𝘢𝘨𝘰𝘯𝘢𝘭 
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘱𝘰𝘥𝘪𝘰𝘤𝘶𝘢𝘥𝘳𝘪
⭒ ִֶָ७ ꯭🥤˙⋆｡ -𝘷𝘦𝘴𝘵𝘪𝘮𝘦𝘯𝘤𝘶𝘢𝘥𝘳𝘪

✮,— \`𝖬𝖠𝖯𝖠𝖲 𝖥𝖱𝖤𝖤 𝖥𝖨𝖱𝖤\` .ᐟᨮׁׅ֮.ᐟ
⭒ ִֶָ७ ꯭🏞️˙⋆｡ -𝖻𝖾𝗋𝗆𝗎𝖽𝖺
⭒ ִֶָ७ ꯭🌅˙⋆｡ -𝗉𝗎𝗋𝗀𝖺𝗍𝗈𝗋𝗂𝗈
⭒ ִֶָ७ ꯭🏜️˙⋆｡ -𝗄𝖺𝗅𝖺𝗁𝖺𝗋𝗂
⭒ ִֶָ७ ꯭🌄˙⋆｡ -𝗇𝖾𝗑𝗍𝖾𝗋𝗋𝖺
⭒ ִֶָ७ ꯭🏞️˙⋆｡ -𝖺𝗅𝗉𝖾𝗌

> © 𝐗 𝐁𝐎𝐓 𝖨𝖠 𝖝 Rich-𝗑𝗒𝗓
`

  await conn.sendMessage(m.chat, {
    react: { text: '🔥', key: m.key }
  })

  await conn.sendMessage(
    m.chat,
    {
      video: { url: vi[0] },
      caption: menu,
      gifPlayback: true, // 🔁 esto asegura loop infinito
      mentions: [m.sender]
    },
    { quoted: m }
  )
}

handler.customPrefix = /^\.?(menu3|menufreefire|menuff)$/i;
handler.command = new RegExp
export default handler